import React from 'react';
import { Link } from 'react-router-dom';
import visa from '../../images/visa.png';
import usdt from '../../images/usdt.png';
import card from '../../images/card.png';
import './footer.css';

function Footer() {
  return ( 
    <div className='footer__content'>
      <div className='footer__content__links'>
        <div className='footer__content__links__item'>
          <div className='logo'>
            <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="none">
              <path fillRule="evenodd" clipRule="evenodd" d="M7.49457 0.00056303C7.49457 0.000386912 7.49471 0.000244141 7.49488 0.000244141H14.9939C14.9941 0.000244141 14.9942 0.000377597 14.9942 0.000542224C14.9942 0.000706791 14.9943 0.000840223 14.9945 0.000840311C23.2745 0.00530225 29.9855 6.71898 29.9855 15.0001C29.9855 23.2821 23.273 29.9964 14.9917 29.9993C14.9887 29.9993 14.9862 29.9969 14.9862 29.9939C14.9862 29.9909 14.9838 29.9885 14.9808 29.9885H11.5781C10.9004 29.9885 10.351 29.4391 10.351 28.7614V23.7185C10.351 23.0409 10.9004 22.4915 11.5781 22.4915H15.3372C19.3164 22.3084 22.4862 19.0243 22.4862 14.9999C22.4862 10.858 19.1285 7.50029 14.9866 7.50029H14.9864C14.9863 7.50029 14.9862 7.5002 14.9862 7.50008C14.9862 7.49997 14.9861 7.49987 14.986 7.49987H9.03946H8.22866C7.82603 7.49987 7.49963 7.82627 7.49963 8.22891V28.7732C7.49963 29.4509 6.95025 30.0003 6.27257 30.0003H1.54489H0.734098C0.328667 30.0003 0 29.6716 0 29.2662V1.22794C0 0.550256 0.549374 0.00088192 1.22706 0.00088192H7.49425C7.49442 0.00088192 7.49457 0.000739148 7.49457 0.00056303Z" fill="url(#paint0_linear_201_1342)"/>
              <defs>
              <linearGradient id="paint0_linear_201_1342" x1="-13.3393" y1="43.3009" x2="39.1734" y2="-5.2497" gradientUnits="userSpaceOnUse">
              <stop stopColor="#0A6FCC"/>
              <stop offset="1" stopColor="#3BED4D" stopOpacity="0.75"/>
              </linearGradient>
              </defs>
            </svg>
            <span className='logo__text'>proxy</span>
          </div>
          <text>Как с нами связаться</text>
          <div className='footer__content__icon__box'>
            <div className='icon'>
              <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="#5F98D1">
              <path d="M14.9998 29.9997C23.284 29.9997 29.9996 23.284 29.9996 14.9998C29.9996 6.71565 23.284 0 14.9998 0C6.71565 0 0 6.71565 0 14.9998C0 23.284 6.71565 29.9997 14.9998 29.9997Z"/>
              <path d="M30 14.9996C30 14.6341 29.9862 14.2719 29.9606 13.9129L23.7438 7.69629L6.25616 14.5751L12.947 21.2661L13.0348 21.582L13.1484 21.4675L13.1489 21.4679L13.0348 21.582L20.4362 28.9834C26.0331 26.8061 30 21.3664 30 14.9996Z"/>
              <path d="M13.5432 17.185L20.322 22.3029L23.7438 7.69629L6.25607 14.5751L11.5774 16.3377L21.2889 9.82348L13.5432 17.185Z" fill="white"/>
              <path d="M11.5774 16.3375L13.0348 21.5818L13.5432 17.1847L21.2889 9.82324L11.5774 16.3375Z" fill="#D2D2D7"/>
              <path d="M15.7463 18.8489L13.0348 21.5827L13.5432 17.1855L15.7463 18.8489Z" fill="#B9B9BE"/>
              </svg>
            </div>
            <div className='icon'>
              <svg xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 30" fill="#5F98D1">
              <path d="M15 30C23.2843 30 30 23.2843 30 15C30 6.71573 23.2843 0 15 0C6.71573 0 0 6.71573 0 15C0 23.2843 6.71573 30 15 30Z"/>
              <path d="M24.3641 8.64111H5.59911L12.3971 15.7196L14.3588 17.7059C13.2915 17.4619 13.2254 17.3099 12.7525 16.9237C12.5044 16.7212 12.0251 16.1707 11.2971 15.4273L5.16898 9.16951V20.8192L5.65325 21.3035L5.59905 21.3599L14.2195 29.9804C14.4781 29.9937 14.7382 30.0005 15 30.0005C23.2843 30.0005 30 23.2848 30 15.0005C30 14.7517 29.9936 14.5045 29.9817 14.2587L24.3641 8.64111Z"/>
              <path d="M5.16898 9.16951V20.8192L10.8501 14.9708L5.16898 9.16951ZM24.831 9.16951V20.8192L19.1782 14.9944L24.831 9.16951ZM5.59911 8.64111H24.3641L16.9892 16.3203C16.7294 16.5907 16.4177 16.8059 16.0727 16.9529C15.7277 17.0999 15.3566 17.1756 14.9816 17.1756C14.6066 17.1756 14.2355 17.0999 13.8905 16.9529C13.5456 16.8059 13.2338 16.5907 12.9741 16.3203L5.59911 8.64111Z" fill="white"/>
              <path d="M17.4146 16.728C16.7818 17.3868 15.8951 17.7648 14.9816 17.7648C14.0682 17.7648 13.1814 17.387 12.5487 16.7281L11.2977 15.4255L5.59909 21.3592H24.364L18.6654 15.4255L17.4146 16.728Z" fill="white"/>
              </svg>
            </div>
          </div>
        </div>
        <div className='footer__content__links__item'>
          <Link to={'#'} className='link'>Тарифы</Link>
          <Link to={'#'} className='link'>FAQ</Link>
          <Link to={'#'} className='link'>Для партнеров</Link>
          <Link to={'#'} className='link'>Контакты</Link>
        </div>
        <div className='footer__content__links__item'>
          <text>Способы оплаты</text>
          <div className='payment__icons'>
            <img src={visa} />
            <img src={card} />
            <img src={usdt} />
          </div>
        </div>
      </div>
      <div className='footer__content__text'>
        <text>© 2023 Dproxy</text>
        <text>Политика обработки персональных данных</text>
      </div>
    </div>
  );
}

export default Footer;