import React from 'react';
import './faq.css';

function Faq() {
  return ( 
    <>
      <div className="faq__title">
        <h2>Часто задаваемые вопросы</h2>
        <h5>FAQ по работе mobile proxy</h5>
      </div>
      <div className='faq__acardeon'>
        <div className='faq__acardeon__item'>
          <div className='faq__acardeon__control'>
            <h4>Что такое мобильные 4G прокси?</h4>
            <div>
              <svg xmlns="http://www.w3.org/2000/svg" width="12" height="8" viewBox="0 0 12 8" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.7046 6.95094C11.5171 7.13844 11.2628 7.24378 10.9976 7.24378C10.7325 7.24378 10.4781 7.13844 10.2906 6.95094L6.01361 2.65915L1.70761 6.95094C1.52008 7.13844 1.26577 7.24378 1.00061 7.24378C0.735446 7.24378 0.481137 7.13844 0.29361 6.95094C0.200909 6.85882 0.127351 6.74926 0.0771484 6.62858C0.0269454 6.50791 0.00109863 6.37851 0.00109863 6.24781C0.00109863 6.11711 0.0269454 5.98771 0.0771484 5.86703C0.127351 5.74636 0.200909 5.6368 0.29361 5.54468L5.3096 0.543784C5.49794 0.357433 5.75219 0.25293 6.01712 0.25293C6.28205 0.25293 6.53627 0.357433 6.72461 0.543784L11.7086 5.54468C11.8013 5.63693 11.8748 5.74666 11.9248 5.86749C11.9748 5.98833 12.0003 6.11786 12 6.24863C11.9996 6.37941 11.9733 6.50883 11.9226 6.62938C11.8719 6.74993 11.7978 6.85922 11.7046 6.95094Z" fill="url(#paint0_linear_373_278)"/>
              <defs>
                <linearGradient id="paint0_linear_373_278" x1="-5.33669" y1="10.3433" x2="5.73404" y2="-7.23295" gradientUnits="userSpaceOnUse">
                <stop stop-color="#0A6FCC"/>
                <stop offset="1" stop-color="#3BED4D" stop-opacity="0.75"/>
                </linearGradient>
              </defs>
              </svg>
            </div>
          </div>
          <div className='faq__acardeon__text'>
            <div className='faq__acardeon__border'></div>
            <p>4G прокси, как и классические прокси, — пропускают через себя поток данных от пользователя к серверу и 
            получают ответный запрос. Мобильные прокси задействуют множество IP, используемые, в основном, 
            для мобильных девайсов. Такие IP-адреса постоянно меняются и не вызывают со стороны сервера подозрений, 
            т. к. ими пользуются сотни и тысячи пользователей. У сервера площадки не возникает сомнений, 
            что запрос делает обычный человек, а не робот, поэтому сервер смягчает для них ограничения</p>
          </div>
        </div>
        <div className='faq__acardeon__item'>
          <div className='faq__acardeon__control'>
            <h4>Какие преимущества у мобильных прокси?</h4>
            <div>
              <svg xmlns="http://www.w3.org/2000/svg" width="12" height="8" viewBox="0 0 12 8" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.7046 6.95094C11.5171 7.13844 11.2628 7.24378 10.9976 7.24378C10.7325 7.24378 10.4781 7.13844 10.2906 6.95094L6.01361 2.65915L1.70761 6.95094C1.52008 7.13844 1.26577 7.24378 1.00061 7.24378C0.735446 7.24378 0.481137 7.13844 0.29361 6.95094C0.200909 6.85882 0.127351 6.74926 0.0771484 6.62858C0.0269454 6.50791 0.00109863 6.37851 0.00109863 6.24781C0.00109863 6.11711 0.0269454 5.98771 0.0771484 5.86703C0.127351 5.74636 0.200909 5.6368 0.29361 5.54468L5.3096 0.543784C5.49794 0.357433 5.75219 0.25293 6.01712 0.25293C6.28205 0.25293 6.53627 0.357433 6.72461 0.543784L11.7086 5.54468C11.8013 5.63693 11.8748 5.74666 11.9248 5.86749C11.9748 5.98833 12.0003 6.11786 12 6.24863C11.9996 6.37941 11.9733 6.50883 11.9226 6.62938C11.8719 6.74993 11.7978 6.85922 11.7046 6.95094Z" fill="url(#paint0_linear_373_278)"/>
              <defs>
                <linearGradient id="paint0_linear_373_278" x1="-5.33669" y1="10.3433" x2="5.73404" y2="-7.23295" gradientUnits="userSpaceOnUse">
                <stop stop-color="#0A6FCC"/>
                <stop offset="1" stop-color="#3BED4D" stop-opacity="0.75"/>
                </linearGradient>
              </defs>
              </svg>
            </div>
          </div>
        </div>
        <div className='faq__acardeon__item'>
          <div className='faq__acardeon__control'>
            <h4>Как я могу менять IP-адрес мобильного прокси?</h4>
            <div>
              <svg xmlns="http://www.w3.org/2000/svg" width="12" height="8" viewBox="0 0 12 8" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.7046 6.95094C11.5171 7.13844 11.2628 7.24378 10.9976 7.24378C10.7325 7.24378 10.4781 7.13844 10.2906 6.95094L6.01361 2.65915L1.70761 6.95094C1.52008 7.13844 1.26577 7.24378 1.00061 7.24378C0.735446 7.24378 0.481137 7.13844 0.29361 6.95094C0.200909 6.85882 0.127351 6.74926 0.0771484 6.62858C0.0269454 6.50791 0.00109863 6.37851 0.00109863 6.24781C0.00109863 6.11711 0.0269454 5.98771 0.0771484 5.86703C0.127351 5.74636 0.200909 5.6368 0.29361 5.54468L5.3096 0.543784C5.49794 0.357433 5.75219 0.25293 6.01712 0.25293C6.28205 0.25293 6.53627 0.357433 6.72461 0.543784L11.7086 5.54468C11.8013 5.63693 11.8748 5.74666 11.9248 5.86749C11.9748 5.98833 12.0003 6.11786 12 6.24863C11.9996 6.37941 11.9733 6.50883 11.9226 6.62938C11.8719 6.74993 11.7978 6.85922 11.7046 6.95094Z" fill="url(#paint0_linear_373_278)"/>
              <defs>
                <linearGradient id="paint0_linear_373_278" x1="-5.33669" y1="10.3433" x2="5.73404" y2="-7.23295" gradientUnits="userSpaceOnUse">
                <stop stop-color="#0A6FCC"/>
                <stop offset="1" stop-color="#3BED4D" stop-opacity="0.75"/>
                </linearGradient>
              </defs>
              </svg>
            </div>
          </div>
        </div>
        <div className='faq__acardeon__item'>
          <div className='faq__acardeon__control'>
            <h4>Какие есть запреты на использование 4G прокси?</h4>
            <div>
              <svg xmlns="http://www.w3.org/2000/svg" width="12" height="8" viewBox="0 0 12 8" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.7046 6.95094C11.5171 7.13844 11.2628 7.24378 10.9976 7.24378C10.7325 7.24378 10.4781 7.13844 10.2906 6.95094L6.01361 2.65915L1.70761 6.95094C1.52008 7.13844 1.26577 7.24378 1.00061 7.24378C0.735446 7.24378 0.481137 7.13844 0.29361 6.95094C0.200909 6.85882 0.127351 6.74926 0.0771484 6.62858C0.0269454 6.50791 0.00109863 6.37851 0.00109863 6.24781C0.00109863 6.11711 0.0269454 5.98771 0.0771484 5.86703C0.127351 5.74636 0.200909 5.6368 0.29361 5.54468L5.3096 0.543784C5.49794 0.357433 5.75219 0.25293 6.01712 0.25293C6.28205 0.25293 6.53627 0.357433 6.72461 0.543784L11.7086 5.54468C11.8013 5.63693 11.8748 5.74666 11.9248 5.86749C11.9748 5.98833 12.0003 6.11786 12 6.24863C11.9996 6.37941 11.9733 6.50883 11.9226 6.62938C11.8719 6.74993 11.7978 6.85922 11.7046 6.95094Z" fill="url(#paint0_linear_373_278)"/>
              <defs>
                <linearGradient id="paint0_linear_373_278" x1="-5.33669" y1="10.3433" x2="5.73404" y2="-7.23295" gradientUnits="userSpaceOnUse">
                <stop stop-color="#0A6FCC"/>
                <stop offset="1" stop-color="#3BED4D" stop-opacity="0.75"/>
                </linearGradient>
              </defs>
              </svg>
            </div>
          </div>
        </div>
        <div className='faq__acardeon__item'>
          <div className='faq__acardeon__control'>
            <h4>Для чего подойдут мобильные прокси?</h4>
            <div>
              <svg xmlns="http://www.w3.org/2000/svg" width="12" height="8" viewBox="0 0 12 8" fill="none">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.7046 6.95094C11.5171 7.13844 11.2628 7.24378 10.9976 7.24378C10.7325 7.24378 10.4781 7.13844 10.2906 6.95094L6.01361 2.65915L1.70761 6.95094C1.52008 7.13844 1.26577 7.24378 1.00061 7.24378C0.735446 7.24378 0.481137 7.13844 0.29361 6.95094C0.200909 6.85882 0.127351 6.74926 0.0771484 6.62858C0.0269454 6.50791 0.00109863 6.37851 0.00109863 6.24781C0.00109863 6.11711 0.0269454 5.98771 0.0771484 5.86703C0.127351 5.74636 0.200909 5.6368 0.29361 5.54468L5.3096 0.543784C5.49794 0.357433 5.75219 0.25293 6.01712 0.25293C6.28205 0.25293 6.53627 0.357433 6.72461 0.543784L11.7086 5.54468C11.8013 5.63693 11.8748 5.74666 11.9248 5.86749C11.9748 5.98833 12.0003 6.11786 12 6.24863C11.9996 6.37941 11.9733 6.50883 11.9226 6.62938C11.8719 6.74993 11.7978 6.85922 11.7046 6.95094Z" fill="url(#paint0_linear_373_278)"/>
              <defs>
                <linearGradient id="paint0_linear_373_278" x1="-5.33669" y1="10.3433" x2="5.73404" y2="-7.23295" gradientUnits="userSpaceOnUse">
                <stop stop-color="#0A6FCC"/>
                <stop offset="1" stop-color="#3BED4D" stop-opacity="0.75"/>
                </linearGradient>
              </defs>
              </svg>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}

export default Faq;